---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSizeDescription
source: html/8ca6ca0a-d0ff-82a3-19ae-05db14e8790d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationProductDataSizeDescription Property

"Product Size Description"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationProductDataSizeDescription { get; }
```